app/views/pages/_form.html.erb

   Escolha o livro:<br>
   <%= f.select :livro_id, options_from_collection_for_select(Livro.all, :id, :titulo, selected: f.object.livro_id),include_blank:true  %>
---
SELECT  "livros".* FROM "livros"   ORDER BY "livros"."id" DESC LIMIT 1