app/controllers/livros_controller.rb

  def index
    @livros = Livro.all.page(params[:page]).per(PER_PAGE).order('updated_at desc')
---
SELECT  "livros".* FROM "livros"   ORDER BY updated_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "livros"

  def create
    @livro = Livro.new(livro_params)

    respond_to do |format|
      if @livro.save
---
INSERT INTO "livros" ("autor", "capa", "created_at", "editora", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @livro.update(livro_params)
---
UPDATE "livros" SET "titulo" = ?, "updated_at" = ? WHERE "livros"."id" = 1  [["titulo", "Swift: Programe para Iphone e Ipad"], ["updated_at", "2015-11-09 17:36:34.925599"]]

  def destroy
    @livro.destroy
---
DELETE FROM "livros" WHERE "livros"."id" = ?  [["id", 2]]

    def set_livro
      @livro = Livro.find(params[:id])
---
SELECT  "livros".* FROM "livros"  WHERE "livros"."id" = ? LIMIT 1  [["id", 2]]