app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages"   ORDER BY updated_at desc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "pages"
---
  def index
    @pages = Page.all.page(params[:page]).per(PER_PAGE).order("updated_at desc")

INSERT INTO "pages" ("created_at", "data", "livro_id", "livrocompleto", "pagina", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-11-11 18:33:07.703097"], ["data", "2015-11-11"], ["livro_id", 6], ["livrocompleto", "t"], ["pagina", ""], ["updated_at", "2015-11-11 18:33:07.703097"]]
---
  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save

UPDATE "pages" SET "data" = ?, "livrocompleto" = ?, "pagina" = ?, "updated_at" = ? WHERE "pages"."id" = 20  [["data", "23/12/2015"], ["livrocompleto", "t"], ["pagina", ""], ["updated_at", "2016-01-04 12:22:10.703479"]]
---
  def update
    respond_to do |format|
      if @page.update(page_params)

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
  def destroy
    @page.destroy

SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_page
      @page = Page.find(params[:id])